Examples/runTimeCondition/simpleSwakCar/system/runTimeControls
// -*- c++ -*-

runTimeControl1
{
    type            runTimeControl;
    libs            ("libutilityFunctionObjects.so");
    conditions
    {
        condition1
        {
            type            average;
            functionObject  forceCoeffs1;
            fields          (Cd);
            tolerance       1e-3;
            window          20;
            windowType      exact;
        }
    }
    satisfiedAction setTrigger;
    trigger         1;
}

runTimeControlSwak
{
    type            runTimeControl;
    libs            ("libutilityFunctionObjects.so");
    controlMode     trigger;
    triggerStart    1;
    conditions
    {
        condition1
        {
            type            swakExpression;
            valueType       cellZone;
            zoneName        porousZone;
            triggerCondition "time()>100 && max(p)>0";
            triggerConditionAccumulation and;
        }
    }
    satisfiedAction setTrigger;
    trigger         2;
}

runTimeControl2
{
    type            runTimeControl;
    libs            ("libutilityFunctionObjects.so");
    controlMode     trigger;
    triggerStart    2;
    conditions
    {
        condition1
        {
            type            maxDuration;
            duration        100;
        }
    }
    satisfiedAction end;
}

/*
    runTimeControl3
    {
        type            runTimeControl;
        libs            ("libutilityFunctionObjects.so");
        conditions
        {
            condition1
            {
                type            equationInitialResidual;
                fields          (U.component(0));
                value           1e-02;
                mode            minimum;
            }
        }
        satisfiedAction end;
    }
*/
